# 작업1유형
주어진 Dataset에서 CRIM값이 가장 큰 10개의 지역을 구하고
10개의 지역의 CRIM값을 그 중 가장 작은 값으로 대체하라. 그리고
AGE 컬럼 값이 80이상인 대체 된 CRIM 평균값을 구하라

In [202]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e2_p1_1.csv')
df.head(2)

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,NaN,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.9,4.98,24.0
1,0.02731,NaN,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.9,9.14,21.6

In [203]:
df.shape

(506, 14)

In [204]:
df = df.sort_values('CRIM',ascending=False).reset_index(drop=True)
df

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,88.97620,0.0,18.10,0,0.671,6.968,91.9,1.4165,24,666.0,20.2,396.90,17.21,10.4
1,73.53410,0.0,18.10,0,0.679,5.957,100.0,1.8026,24,666.0,20.2,16.45,20.62,8.8
2,67.92080,0.0,18.10,0,0.693,5.683,100.0,1.4254,24,666.0,20.2,384.97,22.98,5.0
3,51.13580,0.0,18.10,0,0.597,5.757,100.0,1.4130,24,666.0,20.2,2.60,10.11,15.0
4,45.74610,0.0,18.10,0,0.693,4.519,100.0,1.6582,24,666.0,20.2,88.27,36.98,7.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
501,0.01311,90.0,1.22,0,0.403,7.249,21.9,8.6966,5,226.0,17.9,395.93,4.81,35.4
502,0.01301,35.0,1.52,0,0.442,7.241,49.3,7.0379,1,284.0,15.5,394.74,5.49,32.7
503,0.01096,55.0,2.25,0,0.389,6.453,31.9,7.3073,1,300.0,15.3,394.72,8.23,22.0
504,0.00906,90.0,2.97,0,0.400,7.088,20.8,7.3073,1,285.0,15.3,394.72,7.85,32.2
505,0.00632,NaN,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0

In [205]:
top10 = df.head(10)['CRIM'].iloc[-1]
top10

25.9406

In [206]:
df.loc[:9,"CRIM"] = top10

In [207]:
df[df.AGE>=80].CRIM.mean()

5.759386625

## 1-1에서 사용한 데이터에서 RM 중앙값으로 해당 컬럼의 결측치를 대체하라
그리고 해당 컬럼의 결측치 대치 전후의 표준편차 차이의 절댓값을 소숫점 이하 3째자리 까지 구하라

In [208]:
before = df['RM'].std()
before

0.7212529033559508

In [209]:
df['RM'] = df['RM'].fillna(df['RM'].median())

In [210]:
after = df['RM'].std()
after

0.6938906198881792

In [211]:
diff = round(abs(after - before),3)
diff

0.027

# 3. 주어진 Dataset의 DIS 평균으로 부터 1.5 * 표준편차를 벗어나는 영역을 이상치라고 판단하고 DIS 컬럼의 이상치들의 합을 구하여라.

In [212]:
upper_outline = df['DIS'].mean() + 1.5 * df['DIS'].std()
lower_outline = df['DIS'].mean() - 1.5 * df['DIS'].std()

df[(df['DIS'] < lower_outline) | (df['DIS'] > upper_outline)]['DIS'].sum()

404.4101

# 작업형 2

## 데이터 설명 : e-commerce 배송의 정시 도착여부 (1: 정시배송 0 : 정시미배송)
x_train 데이터로 학습한 모델을 x_test에 적용하여 예측한 결과를 제출하라. 평가 지표는 f1_score이다.

In [213]:
import pandas as pd
#데이터 로드
x_train = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/shipping/X_train.csv")
y_train = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/shipping/y_train.csv")
x_test= pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/shipping/X_test.csv")


display(x_train.head())
display(y_train.head())

,ID,Warehouse_block,Mode_of_Shipment,Customer_care_calls,Customer_rating,Cost_of_the_Product,Prior_purchases,Product_importance,Gender,Discount_offered,Weight_in_gms
0,6045,A,Flight,4,3,266,5,high,F,5,1590
1,44,F,Ship,3,1,174,2,low,M,44,1556
2,7940,F,Road,4,1,154,10,high,M,10,5674
3,1596,F,Ship,4,3,158,3,medium,F,27,1207
4,4395,A,Flight,5,3,175,3,low,M,7,4833

     ID  Reached.on.Time_Y.N
0  6045                    0
1    44                    1
2  7940                    1
3  1596                    1
4  4395                    1

In [214]:
x_test

,ID,Warehouse_block,Mode_of_Shipment,Customer_care_calls,Customer_rating,Cost_of_the_Product,Prior_purchases,Product_importance,Gender,Discount_offered,Weight_in_gms
0,6811,D,Ship,5,2,259,5,low,F,7,1032
1,4320,F,Ship,3,5,133,3,medium,F,4,5902
2,5732,F,Road,3,4,191,5,medium,F,4,4243
3,7429,D,Ship,4,2,221,3,low,M,10,4126
4,2191,D,Flight,4,5,230,2,low,F,38,2890
...,...,...,...,...,...,...,...,...,...,...,...
4396,2610,F,Flight,4,1,157,3,medium,M,31,1712
4397,3406,B,Road,3,5,139,2,medium,M,7,5536
4398,10395,A,Road,4,1,170,10,medium,F,3,5211
4399,3646,B,Ship,3,1,244,3,medium,F,1,5695
4400,573,A,Ship,3,4,234,2,medium,M,46,3108

In [215]:
x_train.shape, y_train.shape, x_test.shape

((6598, 11), (6598, 2), (4401, 11))

In [216]:
x_train.isna().sum()

ID                     0
Warehouse_block        0
Mode_of_Shipment       0
Customer_care_calls    0
Customer_rating        0
Cost_of_the_Product    0
Prior_purchases        0
Product_importance     0
Gender                 0
Discount_offered       0
Weight_in_gms          0
dtype: int64

In [217]:
x_test.isna().sum()

ID                     0
Warehouse_block        0
Mode_of_Shipment       0
Customer_care_calls    0
Customer_rating        0
Cost_of_the_Product    0
Prior_purchases        0
Product_importance     0
Gender                 0
Discount_offered       0
Weight_in_gms          0
dtype: int64

In [218]:
x_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6598 entries, 0 to 6597
Data columns (total 11 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ID                   6598 non-null   int64
 1   Warehouse_block      6598 non-null   object
 2   Mode_of_Shipment     6598 non-null   object
 3   Customer_care_calls  6598 non-null   object
 4   Customer_rating      6598 non-null   int64
 5   Cost_of_the_Product  6598 non-null   int64
 6   Prior_purchases      6598 non-null   int64
 7   Product_importance   6598 non-null   object
 8   Gender               6598 non-null   object
 9   Discount_offered     6598 non-null   int64
 10  Weight_in_gms        6598 non-null   int64
dtypes: int64(6), object(5)
memory usage: 567.1+ KB

In [219]:
x_train.nunique()

ID                     6598
Warehouse_block           5
Mode_of_Shipment          3
Customer_care_calls       6
Customer_rating           5
Cost_of_the_Product     215
Prior_purchases           8
Product_importance        3
Gender                    2
Discount_offered         65
Weight_in_gms          3365
dtype: int64

In [220]:
from sklearn.preprocessing import LabelEncoder

object_columns = x_train.select_dtypes(include="object").columns
object_columns

Index(['Warehouse_block', 'Mode_of_Shipment', 'Customer_care_calls',
       'Product_importance', 'Gender'],
      dtype='object')

In [221]:
X = pd.concat([x_train,x_test],axis=0)
X

,ID,Warehouse_block,Mode_of_Shipment,Customer_care_calls,Customer_rating,Cost_of_the_Product,Prior_purchases,Product_importance,Gender,Discount_offered,Weight_in_gms
0,6045,A,Flight,4,3,266,5,high,F,5,1590
1,44,F,Ship,3,1,174,2,low,M,44,1556
2,7940,F,Road,4,1,154,10,high,M,10,5674
3,1596,F,Ship,4,3,158,3,medium,F,27,1207
4,4395,A,Flight,5,3,175,3,low,M,7,4833
...,...,...,...,...,...,...,...,...,...,...,...
4396,2610,F,Flight,4,1,157,3,medium,M,31,1712
4397,3406,B,Road,3,5,139,2,medium,M,7,5536
4398,10395,A,Road,4,1,170,10,medium,F,3,5211
4399,3646,B,Ship,3,1,244,3,medium,F,1,5695
4400,573,A,Ship,3,4,234,2,medium,M,46,3108

In [222]:
encoders = {}
for col in object_columns:
    encoder = LabelEncoder()
    X[col] = encoder.fit_transform(X[col])
    encoders[col] = encoder

X = X.drop("ID", axis=1)
X

,Warehouse_block,Mode_of_Shipment,Customer_care_calls,Customer_rating,Cost_of_the_Product,Prior_purchases,Product_importance,Gender,Discount_offered,Weight_in_gms
0,0,0,3,3,266,5,0,0,5,1590
1,4,2,2,1,174,2,1,1,44,1556
2,4,1,3,1,154,10,0,1,10,5674
3,4,2,3,3,158,3,2,0,27,1207
4,0,0,4,3,175,3,1,1,7,4833
...,...,...,...,...,...,...,...,...,...,...
4396,4,0,3,1,157,3,2,1,31,1712
4397,1,1,2,5,139,2,2,1,7,5536
4398,0,1,3,1,170,10,2,0,3,5211
4399,1,2,2,1,244,3,2,0,1,5695
4400,0,2,2,4,234,2,2,1,46,3108

In [223]:
n_train = len(x_train)
x_train_df = X.iloc[:n_train]
x_test_df = X.iloc[n_train:]

In [224]:
y_train_series = y_train['Reached.on.Time_Y.N']
y_train_series

0       0
1       1
2       1
3       1
4       1
       ..
6593    1
6594    1
6595    1
6596    0
6597    0
Name: Reached.on.Time_Y.N, Length: 6598, dtype: int64

In [225]:
y_train_series

0       0
1       1
2       1
3       1
4       1
       ..
6593    1
6594    1
6595    1
6596    0
6597    0
Name: Reached.on.Time_Y.N, Length: 6598, dtype: int64

In [227]:
from sklearn.ensemble import RandomForestClassifier
from sklearn.model_selection import train_test_split
from sklearn.metrics import f1_score

model_rf = RandomForestClassifier(random_state=42)

X_train_,  X_valid_, y_train_, y_valid_ = train_test_split(x_train_df, y_train_series, test_size=0.2, random_state=42)
model_rf.fit(X_train_, y_train_)
y_pred_rf = model_rf.predict(X_valid_)
score_rf = f1_score(y_valid_, y_pred_rf)
score_rf

0.6969909027291813

In [228]:
from lightgbm import LGBMClassifier
model_lgbm = LGBMClassifier(random_state=42)
model_lgbm.fit(X_train_, y_train_)
y_pred_lgbm = model_lgbm.predict(X_valid_)
score_lgbm = f1_score(y_valid_, y_pred_rf)
score_lgbm

0.6969909027291813

In [231]:
y_pred = model_rf.predict(x_test_df)
y_pred

array([0, 0, 0, ..., 1, 0, 1], dtype=int64)

In [234]:
result = pd.DataFrame({
    "ID": x_test['ID'],
    "Reached.on.Time_Y.N" : y_pred
})
result

         ID  Reached.on.Time_Y.N
0      6811                    0
1      4320                    0
2      5732                    0
3      7429                    1
4      2191                    1
...     ...                  ...
4396   2610                    1
4397   3406                    0
4398  10395                    1
4399   3646                    0
4400    573                    1

[4401 rows x 2 columns]

In [235]:
result.to_csv('result6.csv', index=False)

test=pd.read_csv('result6.csv')
test

         ID  Reached.on.Time_Y.N
0      6811                    0
1      4320                    0
2      5732                    0
3      7429                    1
4      2191                    1
...     ...                  ...
4396   2610                    1
4397   3406                    0
4398  10395                    1
4399   3646                    0
4400    573                    1

[4401 rows x 2 columns]

# 작업형3

## Q4. 122마리의 height 평균값을 m(미터) 단위로 소숫점 이하 5자리까지 실수 값만 출력하라

In [236]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e2_p3_1.csv')
df.head(5)

     fish   height
0  fish_1  33.74cm
1  fish_2  31.64cm
2  fish_3  27.49cm
3  fish_4  31.43cm
4  fish_5  27.56cm

In [237]:
df.shape

(122, 2)

In [242]:
df['height'].str.replace("cm","").astype(float)

0      33.74
1      31.64
2      27.49
3      31.43
4      27.56
       ...
117    28.11
118    27.67
119    27.12
120    28.68
121    32.20
Name: height, Length: 122, dtype: float64

In [245]:
df['height_raw'] = df['height'].str.replace("cm","").astype(float)

In [246]:
x_bar = round(df['height_raw'].mean() / 100,5 )
x_bar

0.29951

## Q5. 모집단의 평균 길이가 30cm 인지 확인하려 일표본 t 검정을 시행하여 확인하려한다. 검정통계량을 소숫점 이하 3째자리까지 구하여라

In [251]:
귀무가설 = "귀무가설 : 모집단의 평균 길이가 30이다"
대립가설 = "대립가설 : 모집단의 평균 길이가 30이 아니다"

from scipy.stats import ttest_1samp

stat, p = ttest_1samp(df['height_raw'], 30)
round(stat,3)

-0.217

## Q6. 위의 통계량에 대한 p-값을 구하고 (반올림하여 소숫점 이하 3째자리), 유의수준 0.05하에서 귀무가설과 대립가설중 유의한 가설을 하나를 선택하시오(귀무/대립)

In [252]:
round(p,3)

0.829

In [253]:
귀무가설 if p > 0.05 else 대립가설

'귀무가설 : 모집단의 평균 길이가 30이다'

## Q7. 조사결과 70%의 성인 남성이 3년 동안에 적어도 1번 치과를 찾는다고 할때, 21명의 성인 남성이 임의로 추출되었다고 하자.
21명 중 16명 미만이 치과를 찾았을 확률(반올림하여 소숫점 이하 3자리)

In [256]:
from scipy.stats import binom

n= 21
p= 0.7
k= 16

# P(X < k)
prob = binom.cdf(k-1, n, p)
round(prob,3)

0.637

## Q8. 적어도 19명이 치과를 찾았을 확률(반올림하여 소숫점 이하 3자리)

In [258]:
prob2 = 1-binom.cdf(18,n,p)
round(prob2,3)

0.027